## Q1. Create a Pandas Series that contains the following data: 4, 8, 15, 16, 23, and 42. Then, print the series.

In [2]:
import pandas as pd
data = [4,8,15,16,23,42]
series = pd.Series(data)
print(series)

0     4
1     8
2    15
3    16
4    23
5    42
dtype: int64

## Q2. Create a variable of list type containing 10 elements in it, and apply pandas.Series function on the  variable print it.

In [5]:
import pandas as pd

my_list = [1,2,3,4,5,6,7,8,9,10]
series = pd.Series(my_list)
print(series)

0     1
1     2
2     3
3     4
4     5
5     6
6     7
7     8
8     9
9    10
dtype: int64

## Q3. Create a Pandas DataFrame that contains the following data:

Then, print the DataFrame.

In [7]:
import pandas as pd

data = [
    ["Alice" , 25 , "Female" ],
    ["Bob" , 30 , "Male"],
    ["Claire", 27 , "Female"]
]

columns = ["Name" , "Age", "Gender"]

df = pd.DataFrame(data , columns=columns)
print(df)

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

# Q4. What is ‘DataFrame’ in pandas and how is it different from pandas.series? Explain with an example.

#### - DataFrame :
- i) A DataFrame is a two-dimensional, tabular data structure in Pandas. It is similar to a spreadsheet or a SQL table.

- ii) It consists of rows and columns, where each column can be of a different data type (e.g., integers, floats, strings).

- iii) DataFrames are used to store and manipulate structured data, and they are suitable for working with datasets that have multiple variables or features.

#### - Series :
- i) A Series is a one-dimensional labeled array in Pandas. It can be thought of as a single column of data.

 - ii) Each element in a Series is associated with an index label, which can be either implicitly generated or explicitly defined.
 
 - iii) They are often used for time series data, individual columns of a DataFrame, or as the result of selecting a single column from a DataFrame.

In [10]:
import pandas as pd

data = {
    'Name' :['Alice', 'Bob', 'Charlie'],
    'Age' : [25, 30, 35]
}
df = pd.DataFrame(data)
print("DataFrame:")
print(df)

# Creating a series

ages = pd.Series([25, 30, 35], name = 'Age')
print("\nSeries")
print(ages)

DataFrame:
      Name  Age
0    Alice   25
1      Bob   30
2  Charlie   35

Series
0    25
1    30
2    35
Name: Age, dtype: int64

### Q5. What are some common functions you can use to manipulate data in a Pandas DataFrame? Can you give an example of when you might use one of these functions?

- Filtering Data:

DataFrame.loc[] and DataFrame.iloc[]: Used to select specific rows and columns based on labels or integer indices.

In [11]:
df.loc[df['Age'] > 30]
df.iloc[0:3, 1:3]

   Age
0   25
1   30
2   35

- Sorting Data:

DataFrame.sort_values(): Sorts the DataFrame by one or more columns.

In [12]:
df.sort_values(by='Age', ascending=False)

      Name  Age
2  Charlie   35
1      Bob   30
0    Alice   25

Handling Missing Data:

DataFrame.dropna(): Drops rows or columns with missing values.
DataFrame.fillna(): Fills missing values with a specified value or method.

In [14]:
df.dropna()        
df.fillna(0)

      Name  Age
0    Alice   25
1      Bob   30
2  Charlie   35

##### Q6. Which of the following is mutable in nature Series, DataFrame, Panel?

- In Pandas, a Series is mutable in nature, while both DataFrame and Panel are not mutable.

### Q7. Create a DataFrame using multiple Series. Explain with an example.

In [16]:
import pandas as pd

names = pd.Series(['Alice', 'Bob', 'Charlie'])
ages = pd.Series([25, 30, 35])
city = pd.Series(['New York', 'Los Angeles', 'Chicago'])


data = {
    'Name': names,
    'Age': ages,
    'City': city
}

df = pd.DataFrame(data)
print(df)

      Name  Age         City
0    Alice   25     New York
1      Bob   30  Los Angeles
2  Charlie   35      Chicago